---
kind: other
id: Properties.T:Autodesk.Revit.DB.BeamSystem
source: html/d5088c30-5fb3-e07d-6730-a86bfb21eeb4.htm
---
# BeamSystem Properties

The id of the assembly instance to which the element belongs.